[
    {
        "id": 0,
        "title": "Local Library Backend",
        "photo": "../../Static/photos/local-library.jpg",
        "link": "https://github.com/Stephan543/mdnLocalLibrary",
        "tags": ["Node.js","Express","MVC", "MongoDB", "Azure"],
        "summary": [
            "This project is a simple library system, that can create, read, update and delete information about books, copies, status and authors. ",
            "Implementing Routes, controllers, models, views and popolating a Mongo database on Azure was an incredible learning experience. Through this project I realised my interest pique towards the server side.",
            "Check out the deployed project link in my open source README file!"
        ],
        "future": [
            "I would like to deploy similair projects to a dedicated private server. The intention behind this is to learn how to operate on both Platform and Infastracture as-a-Service (PaaS and IaaS).",
            "Given more time I would like to make it a comprehensive front end to style up the views. Probably with React and Tailwind(New tech to me).",
            "I will build a Unix machine that I can perform server side programming on. Either a Raspberry Pi or an old Computer."
        ]
    },
    {
        "id": 1,
        "title": "Time Picker",
        "photo": "../../Static/photos/time-picker.jpg",
        "link":"",
        "tags": ["Node.js","JavaScript", "googleapis"],
        "summary": [
            "This project is a script that can access the Google Calendar API via OAuth 2.0 and return an array of the users empty time slots.",
            "The tricky part for me was that the API only returned existing meeting times in a given window(1 week) but I needed to return an array of full meeting times. The other constraints were: specific daily start/end(8am-8pm EST) times and a preferred time chunk(30mins- 1hr) to search.",
            "In the end I learned alot about how to process dates and ended up implementing a recursive algorithms that populates an array for all available dates within the constraints."
        ],
        "future": [
            "Combine this solution with a completely styled front end solution to use as a plug-in for my websites",
            "Give users the option to view the available array in dynamic 'week' view. Allow users to select 30min to 1hr available time meetings that forwards a google calendar email request to me.",
            "Optimize and Deploy the project as a light weight plug-in that can be added to my websites."
        ]
    },
    {
        "id": 2,
        "title": "My Portfolio (This Website!)",
        "photo": "",
        "link":"",
        "tags": ["React","Material-UI","JavaScript", "CSS"],
        "summary": [
            "This project uses hooks for light and dark mode themes, cards and navbars(combined with react-router).",
            "The intention behind this project was to develop my React skills and serve a static and stateful website to those that are interested.",
            "I wanted to learn the basics UI kit so I chose material and went with a CSS in JS method(Including media queries for responsiveness). Some of the material ui components I used were layouts, themes, tabs, buttons and cards."
        ],
        "future": [
            "I personally find visually creative tasks pretty difficuly. So I would like to redesign the palette and layout in the future.",
            "After speaking to some friends in industry, I would to learn Tailwind CSS in newer versions, mainly for practice.",
            "While designing this project I debated making this a full-stack application, one where I host my time viewer app. I would like to purchase a VPS, so I can serve my schedule data dynamically for users."
        ]
    },
    {
        "id": 3,
        "title": "Recipe Website",
        "photo": "",
        "link":"https://github.com/Stephan543/PersonalWebsite",
        "tags": ["HTML5","PHP","JavaScript", "CSS"],
        "summary": [
            "This website allows me to store my go to recipes and create adjustments to the quantities based on the desired recipe yield.",
            "Up until the start of this project, I knew rumours about programming and webdevelopment. This was clear when I jumped into the project development. I am proud to say that now I have experiential knowledge in web development.",
            "One of the biggest challenges was the responsiveness on different devices. Every issue a user had, meant an addition to the code base in order to catch the edge case. This is why my CSS files are so large."
        ],
        "future": [
            "In the future I will redesign and deploy this website in a full-stack fashion. Likely using the MERN stack likely using a free host like Heroku.",
            "The load time for the image pages are pretty slow at the moment, but I hope this will be solved when importing the images into react.",
            "The styling could use some work and as well a more holistic approach to responsivenes will be used in the future. It is likely I will use Tailwind or Material-UI with React."
        ]
    }

]